       01  REG-PRODUTO.
           05 COD-PRODUTO            PIC 9(14).
           05 DESC-PRODUTO           PIC X(50).
           05 FK-COD-TIPO            PIC X(10).
